// Норма
// 1. Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”
let userName = prompt('Як тебе звати?');
console.log(`Привіт, ${userName}!`);

// 2. Запитай рік народження користувача, порахуй його/її вік і виведи результат. Поточний рік вкажи в коді як константу
const CARRENT_YEAR = 2022;
let birthYear = +(prompt('Введіть свій рік народження'));
let userAge = CARRENT_YEAR - birthYear;
console.log(`Тобі ${userAge} років`);

// 3. Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата
let sideSquare = prompt('Введіть довжину сторони квадрата');
let perimeterSquare = (sideSquare * 4).toFixed(3);
console.log(`Периметр квадрата зі стороною ${sideSquare} становить: ${perimeterSquare}`);

// 
// 1. Запитай у користувача радіус кола і виведи площу такої окружності.
let radiusCircle = +prompt('Введіть радіус кола');
let areaCircle = (Math.PI * (radiusCircle ** 2)).toFixed(3);
console.log(`Площа кола з радіусом ${radiusCircle} становить: ${areaCircle}`);

// 2. Запитай у користувача відстань в кілометрах між двома містами і за скільки годин він хоче дістатися. Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно
let distance = +prompt('Введіть відстань в кілометрах між двома містами');
let time = +prompt(`Введіть час: за скільки годин ви хоче подолати відстань ${distance}`);
let speed = Math.ceil(distance / time);
console.log(`Швидкість, з якою необхідно рухатися, щоб встигнути вчасно: ${speed} км/год`);

// 3. Реалізуй конвертор валют. Користувач вводить долари, програма переводить їх в євро. Курс валют зберігається в константі.
const RATE = 1.00371;
let dollar = +prompt('Введіть суму в доларах', '1');
let euro = (dollar * RATE).toFixed(2);
console.log(`${dollar} USD еквівалентно ${euro} EUR`);